[{"Id":5,"Text":"Conditional tenses are used to speculate about what could happen, what might have happened, and what we wish would happen. In English, most sentences using the conditional contain the word if. Many conditional forms in English are used in sentences that include verbs in one of the past tenses. This usage is referred to as “the unreal past” because we use a past tense but we are not actually referring to something that happened in the past. There are five main ways of constructing conditional sentences in English. In all cases, these sentences are made up of an if clause and a main clause. In many negative conditional sentences, there is an equivalent sentence construction using “unless” instead of \"if\".","TopicId":14},{"Id":6,"Text":"The zero conditional is used for when the time being referred to is now or always and the situation is real and possible. The zero conditional is often used to refer to general truths. The tense in both parts of the sentence is the simple present. In zero conditional sentences, the word \"if\" can usually be replaced by the word \"when\" without changing the meaning.","TopicId":14},{"Id":7,"Text":"The type 1 conditional is used to refer to the present or future where the situation is real. The type 1 conditional refers to a possible condition and its probable result. In these sentences the if clause is in the simple present, and the main clause is in the simple future.","TopicId":14},{"Id":8,"Text":"The type 2 conditional is used to refer to a time that is now or any time, and a situation that is unreal. These sentences are not based on fact. The type 2 conditional is used to refer to a hypothetical condition and its probable result. In type 2 conditional sentences, the if clause uses the simple past, and the main clause uses the present conditional.","TopicId":14},{"Id":9,"Text":"The type 3 conditional is used to refer to a time that is in the past, and a situation that is contrary to reality. The facts they are based on are the opposite of what is expressed. The type 3 conditional is used to refer to an unreal past condition and its probable past result. In type 3 conditional sentences, the if clause uses the past perfect, and the main clause uses the perfect conditional.","TopicId":14},{"Id":10,"Text":"A clause is a part of a sentence. There are two main types: independent (main clauses), dependent (subordinate clauses).","TopicId":15},{"Id":11,"Text":"An independent clause is a complete sentence; it contains a subject and verb and expresses a complete thought in both context and meaning.","TopicId":15},{"Id":12,"Text":"Independent clauses can be joined by a coordinating conjunction to form complex or compound sentences.","TopicId":15},{"Id":13,"Text":"Coordinating conjunctions: and, but, for, or, nor, so, yet.","TopicId":15},{"Id":14,"Text":"A dependent (subordinate) clause is part of a sentence; it contains a subject and verb but does not express a complete thought. They can make sense on their own, but, they are dependent on the rest of the sentence for context and meaning. They are usually joined to an independent clause to form a complex sentence.","TopicId":15},{"Id":15,"Text":"Subordinating conjunctions: after, before, in order that, since, though, whenever, whether, although, even if, once, so that, unless, where, while, as, even though, provided that, than, until, whereas, why, because, if, rather than, that, when, wherever.","TopicId":15},{"Id":16,"Text":"Relative pronouns: that, which, whichever, who, whoever, whom, whose,  whosever, whomever.","TopicId":15},{"Id":17,"Text":"Some relative clauses are not used to define or identify the preceding noun but to give extra information about it","TopicId":15},{"Id":18,"Text":"Уравнение вида ax^2 + bx + c = 0, где, a , b , c - действительные числа, причем a ≠ 0 , называют квадратным уравнением. Если a = 1 , то квадратное уравнение называют приведенным; если a ≠ 1 , - то неприведенным. Числа a , b , c носят следующие названия a - первый коэффициент, b - второй коэффициент, c - свободный член.","TopicId":16},{"Id":19,"Text":"X = (-b ± sqrt(D))/2a","TopicId":16},{"Id":20,"Text":"Выражение D = b 2 - 4 ac называют дискриминантом квадратного уравнения. Если D < 0, то уравнение не имеет действительных корней; если D = 0, то уравнение имеет один действительный корень; если D > 0, то уравнение имеет два действительных корня.","TopicId":16},{"Id":21,"Text":"Теорема Виета.    Если приведенное квадратное уравнение x2 + p*x + q =0 имеет действительные корни, то их сумма равна - p , а произведение равно q , то есть x1 + x2 = -p, x1 + x2 = q","TopicId":16},{"Id":22,"Text":"В 6 часов утра 12 июня 1812 года для России началась отечественная война с наполеоновской Францией. Войска Наполеона пересекли Неман и направились вглубь страны. Главное направление удара предполагалось по Москве. Сам же полководец говорил, что «если я захвачу Киев – подниму русских за ноги, захвачу Санкт-Петербург – возьму за горло, если возьму Москву – поражу сердце России».","TopicId":17},{"Id":23,"Text":"Французская армия, которой командовали гениальные полководцы, искала генерального сражения и то, что Александр 1 разделил армию на 3 фронта, был весьма на руку агрессорам. Однако, на начальном этапе решающее значение сыграл Барклай де Толи, который отдал приказ не вступать в битву с врагом и отступать вглубь страны. Это было необходимо, чтобы объединить силы, а также подтянуть резервы. Отступая, русские уничтожали все – убивали скот, отравляли воду, сжигали поля. В буквальном смысле этого слова французы двигались вперед по пепелищу. Позже Наполеон жаловался на то, что русский народ осуществляет подлую войну и ведет себя не по правилам.","TopicId":17},{"Id":24,"Text":"32 тысячи человек во главе с генералом Макдональдом Наполеон направил на Санкт-Петербург. Первым городом на этом пути была Рига. По плану Франции Макдональд должен был захватить город. Соединиться с генералом Удино (в его распоряжении было 28 тысяч человек) и отправиться дальше.","TopicId":17},{"Id":25,"Text":"Обороной Риги командовал генерал Эссен с 18 тысячи солдат. Он сжег все вокруг города, а сам город очень хорошо укрепил. Макдональд к этому времени захватил Динабург (русские оставили город с началом войны) и дальше активных действий не вел. Он понимал абсурдность штурма Риги и ждал прибытия артиллерии.","TopicId":17},{"Id":26,"Text":"Генерал Удино занял Полоцк и оттуда пытался разделить корпус Виттенштейна от армии Барклая де Толи. Однако, 18 июля Виттенштейн нанес неожиданный удар по Удино, которого от поражения спас только подоспевший корпус Сен-Сира. В результате наступило равновесие и больше активных наступательных действий на северном направлении не велось.","TopicId":17},{"Id":27,"Text":"Генерал Ранье с войском в 22 тысячи человек должен был действовать на юном направлении, блокируя армию генерала Тормасова, не давая ей соединиться с остальными частями русской армии.","TopicId":17},{"Id":28,"Text":"27 июля Тормасов окружил город Кобрин, где собрались главные силы Ранье. Французы потерпели страшное поражение – за 1 день в сражении было убито 5 тысяч человек, что заставило французов отступить. Наполеон понял, что южное направление в Отечественной войне 1812 находится под угрозой провала. Поэтому перебросил туда войска генерала Шварценберга, численностью в 30 тысяч человек. В результате этого 12 августа Тормасов был вынужден отступить к Луцку и занять там оборону. В дальнейшем активных наступательных действий на южном направлении французы не предпринимали. Главные события происходили на московском направлении.","TopicId":17},{"Id":29,"Text":"26 июня из Витебска выдвинулась армия генерала Багратиона, в задачу которому Александр 1 поставил вступление в бой с главными силами противника с целью измотать их. Все осознавали абсурдность данной идеи, но только к 17 июля императора удалось окончательно отговорить от этой затеи. Войска начали отступление к Смоленску.","TopicId":17},{"Id":30,"Text":"6 июля стало понятна большая численность войск Наполеона. Чтобы Отечественная война не затягивалась на длительный срок, Александр 1 подписывает указ о создании ополчения. В него записываются буквально все жители страны – всего добровольцев набралось порядка 400 тысяч.","TopicId":17},{"Id":31,"Text":"22 июля армии Багратиона и Барклая де Толли соединились под Смоленском. Командование объединенной армией принял на себя Барклай де Толли, в распоряжении которого оказалось 130 тысяч солдат, в то время, как передовой отрад французской армии насчитывал 150 тысяч солдат.","TopicId":17},{"Id":32,"Text":"25 июля был проведен военный совет в Смоленске, на котором обсуждался вопрос принятия боя, с тем, чтобы перейти в контрнаступление и одним ударом разбить Наполеона. Но Барклай высказался против этой идеи, понимая, что открытое сражение с врагом, гениальным стратегом и тактиком, может привести к грандиозному провалу. В результате идея с наступлением не была реализована. Было принято решение отступать дальше – к Москве.","TopicId":17},{"Id":33,"Text":"26 июля началось отступление войск, прикрывать которое должен был генерал Неверовский, заняв село Красное, закрывая тем самым обход Смоленска для Наполеона.","TopicId":17},{"Id":34,"Text":"2 августа Мюрат с конным корпусом попытался прорвать оборону Неверовского, но безуспешно. Всего было предпринято более 40 атак с помощью кавалерии, но добиться желаемого не удалось.","TopicId":17},{"Id":35,"Text":"5 августа – одна из важных дат в Отечественной войне 1812 года. Наполеон начал штурм Смоленска, захватив к вечеру пригород. Однако, ночью он был выбит из города, а русская армия продолжила массовое отступление из города. Это вызвало бурю недовольства солдат. Они считали, что если удалось выбить французов из Смоленска, то нужно было его уничтожить там же. Они обвиняли Барклая в трусости, но генерал реализовывал только 1 план – измотать противника и принять решающий бой тогда, когда соотношение сил будет на стороне России. К этому же времени все преимущество было у французов.","TopicId":17},{"Id":36,"Text":"17 августа в армию прибыл Михаил Илларионович Кутузов, который принял на себя командование. Эта кандидатура вопросов не вызывала, поскольку Кутузов (ученик Суворова) пользовался большим уважением и считался лучшим российским полководцем после смерти Суворова. Прибыв в армию, новый главнокомандующий писал, что еще не решил, как поступать дальше: «Вопрос еще не решен – или армию потерять, или Москву отдать».","TopicId":17},{"Id":37,"Text":"26 августа случилась бородинская битва. Ее исход до сих пор вызывает много вопросов и споров, но проигравших тогда не было. Каждый полководец решил свои задачи: Наполеон открыл себе дорогу в Москву (сердце России, как писал сам император Франции), а Кутузов смог нанести врагу сильный урон, тем самым внеся начальный перелом в сражение 1812 года.","TopicId":17},{"Id":38,"Text":"1 сентября – знаковый день, который описан во всех учебниках истории. Состоялся военный совет в Филях, под Москвой. Кутузов собрал своих генералов, чтобы решить, что делать дальше. Вариантов было всего два: отступить и сдать Москву, либо после Бородино организовать второе генеральное сражение. Большинство генералов на волне успеха требовали битвы, чтобы в кратчайшие сроки разбить Наполеона. Противниками такого развития событий выступали сам Кутузов и Барклай де Толли. Закончился военный совет в Филях фразой Кутузов «Пока есть армия – есть надежда. Потеряем армию под Москвой – лишимся не только древней столицы, но и всей России».","TopicId":17},{"Id":39,"Text":"2 сентября – по итогам военного совета генералов, который произошел в Филях, постановили, что необходимо покинуть древнюю столицу. Русская армия отступила, а сама Москва перед приходом Наполеона, по данным многих источников, подверглась страшному мародерству. Однако, даже не это главное. Отступая, русская армия зажгла город. Деревянная Москва сгорела практически на три четверти. Самое же главное – уничтожены были буквально все склады продовольствия. Причины московского пожара кроются в том, чтобы французам ничего не досталось из того, что врагами может быть использовано для питания, передвижения или в других аспектах. В результате войска агрессоров очутились в очень шатком положении.","TopicId":17},{"Id":40,"Text":"Заняв Москву, Наполеон посчитал миссию выполненной. Библиографы полководца позже писали, что он был верен - потеря исторического центра Руси сломит победный дух, а руководители страны должны были прийти к нему с просьбой о мире. Но этого не случилось. Кутузов расположился с армией в 80 километрах от Москвы у Тарутина и ждал, пока лишенная нормального снабжения армия противника ослабнет и сама внесет коренной перелом в Отечественную войну. Не дождавшись предложения мира от России, французский император сам выступил с инициативой.","TopicId":17},{"Id":41,"Text":"Для Наполеона стало очевидно, что мирный договор с Россией ему не удастся подписать, а оставаться на зиму в Москве, которую русские, отступая, сожгли – безрассудство. Более того, оставаться здесь было невозможно, поскольку постоянные набеги ополченцев наносили большой урон армии. Так, за месяц, пока французская армия была в Москве, ее численность сократилась на 30 тысяч человек. В результате было принято решение отступать.","TopicId":17},{"Id":42,"Text":"7 октября начались приготовления к отступлению французской армии. Одним из приказов по этому поводу было взорвать Кремль. К счастью эта затея ему не удалась. Русские историки списывают это на то, что из-за большой влажности фитили промокли  и вышли из строя.","TopicId":17},{"Id":43,"Text":"19 октября началось отступление армии Наполеона из Москвы. Цель этого отступления заключалась в том, чтобы добраться до Смоленска, поскольку это был единственный крупный близлежащий город, в котором имелись значимые продовольственные запасы. Дорога шла через Калугу, но это направление перекрыл Кутузов. Сейчас преимущество было на стороне русской армии, поэтому Наполеон решил обойти. Однако, Кутузов предугадал этот маневр и встретил армию противника у Малоярославца.","TopicId":17},{"Id":44,"Text":"24 октября состоялось сражение под Малоярославцем. В течение дня этот небольшой город переходил 8 раз от одной стороны к другой. В завершающей стадии битвы Кутузов сумел занять укрепленные позиции, а Наполеон не осмелился их штурмовать, поскольку численный перевес уже был на стороне русской армии. В результате планы французов были сорваны, и отступать к Смоленску им пришлось по той же дороге, по которой они шли на Москву. Это была уже выжженная земля – без продовольствия и без воды.","TopicId":17},{"Id":45,"Text":"Отступление Наполеона сопровождалось большими потерями. Ведь кроме столкновений с армией Кутузова, приходилось иметь дело еще и с партизанскими отрядами, которые ежедневно атаковали врага, особенно его замыкающие части. Потери наполеона были страшными. 9 ноября ему удалось захватить Смоленск, но коренного перелома в ход войны это не внесло. Продовольствия в городе практически не было, а организовать надежную оборону не удалось. В результате армия подвергалась практически непрерывным атакам ополченцев и местных патриотов. Поэтому в Смоленске Наполеон пробыл 4 дня и принял решение отступать дальше.","TopicId":17},{"Id":46,"Text":"Французы направлялись к реке Березина (в современной Белоруссии), чтобы форсировать реку и перейти к Неману. Но 16 ноября Генерал Чичагов захватил город Борисов, который находится на Березине. Положение Наполеона стало катастрофическим – впервые для него активно маячила возможность попасть в плен, поскольку он был окружен.","TopicId":17},{"Id":47,"Text":"25 ноября по приказу Наполеона французская армия начала имитировать переправу южнее Борисова. Чичагов купился на этот маневр и начал переброску войск. В этот момент французы соорудили два моста через Березину и начали переправу 26-27 ноября. Только 28 ноября Чичагов осознал свою ошибку и попытался дать бой французской армии, но было уже поздно – переправа была завершена, хотя и потерей огромного количества человеческих жизней.  При переправе через Березину погибла 21 тысяча французов! «Великая армия» теперь составляла всего 9 тысяч солдат, большая часть которых была уже небоеспособна.","TopicId":17},{"Id":48,"Text":"Именно при этой переправе наступили необычайно сильные морозы, на которые французский император и сослался, оправдывая огромные потери. В 29-м бюллетене, который был опубликован в одной из газет Франции, говорилось о том, что до 10 ноября погода была нормально, но после этого наступили очень сильные холода, к которым никто не был готов.","TopicId":17},{"Id":49,"Text":"Переправа через Березину показала, что русский поход Наполеона окончен – он проиграл Отечественную войну в России в 1812 году. Тогда император принял решение, что его дальнейшее пребывание с армией не имеет смысла и 5 декабря покинул свои войска и направился в Париж.","TopicId":17},{"Id":50,"Text":"14 декабря в Ковно французская армия пересекла Неман и покинула территорию России. Ее численность составляла всего 1600 человек. Спустя 6 месяцев и 2 дня война закончилась победой России.","TopicId":17}]